Repository: ramy23149/knisty-app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# name_app
source: loc
ar: اماكن

# title
source: loc
ar: اماكن

# add_khdma
source: add loc
ar: اضافة مكان

source: name loc
ar: اسم المكان

source: floor
ar: الطابق

source: add loc
ar: اضافة المكان

# cancal
source: Cancel
ar: اغلاق

source: Remove
ar: ازالة

# mass_alart
source: Are you sure you want to remove this item?
ar: هل انت متاكد انك تريد ازالة هذا العنصر

# title_alart
source: Remove Item
ar: ازالة العنصر

source: Halls
ar: القاعات

source: Book Hall
ar: حجز قاعة

# add_reservation
source: Add a reservation
ar: اضافة حجز

source: Start Time
ar: وقت البدء

# set_start_time
source: Select Start Time
ar: حدد وقت البدء

source: End Time
ar: وقت الانتهاء

# set_end_time
source: Select End Time
ar: حدد وقت الانتهاء

# time_range
source: Selected Time Range
ar: مدى الوقت المحدد

# choose_date
source: Choose the date
ar: اختر التاريخ

source: Add Hall
ar: اضافة قاعة

source: Profile
ar: الملف الشخصي

source: Time Line
ar: الخط الزمني

source: Add Event
ar: إضافة حدث

source: Admin Panel
ar: لوحة التحكم

# home_made_a_reservation_from
source: made a reservation from
ar: تم الحجز من

source: Make Reservation
ar: إجراء حجز

source: New Service
ar: خدمة جديدة

source: to
ar: إلى

# forr
source: for
ar: من أجل

# inn
source: in
ar: في

# time_line_loading
source: Loading...
ar: جار التحميل...

source: Submit
ar: إرسال

source: please, Select Service
ar: يرجى اختيار الخدمة

source: on
ar: في

source: at
ar: عند

source: to make
ar: لإجراء

source: SELECT YOUR SERVICE
ar: اختر خدمتك

# add_reservation_something_went_wrong
source: Something went wrong
ar: حدث خطأ ما

source: your request sent successfully
ar: تم إرسال طلبك بنجاح

source: sent request
ar: إرسال الطلب

source: please select hall
ar: يرجى اختيار القاعة

# book_hall_something_went_wrong
source: Something went wrong
ar: حدث خطأ ما

source: Remove Hall
ar: إزالة القاعة

source: Hall
ar: القاعة

source: Role
ar: الصلاحيه

source: Sign Up
ar: تسجيل

source: Add New User
ar: إضافة مستخدم جديد

source: Name
ar: الاسم

source: User Name
ar: اسم المستخدم

# admin_feature_wrong_password
source: Wrong Password
ar: كلمة المرور خاطئة

source: Sign Up Successfully
ar: تم التسجيل بنجاح

source: Email
ar: البريد الإلكتروني

source: Enter User Email
ar: أدخل البريد الإلكتروني للمستخدم

source: Password
ar: كلمة المرور

source: Select Services
ar: اختر الخدمات

source: please select service type
ar: يرجى اختيار نوع الخدمة

source: please select role type
ar: يرجى اختيار نوع الدور

source: Enter Admin Password
ar: أدخل كلمة مرور المسؤول

source: Admin Password
ar: كلمة مرور المسؤول

source: Enter Service Type
ar: أدخل نوع الخدمة

source: Service
ar: الخدمة

source: Service Type
ar: نوع الخدمة

source: Cancel
ar: إلغاء

source: OK
ar: موافق

source: App Users
ar: مستخدمي التطبيق

source: No Users yet
ar: لا يوجد مستخدمين بعد

# wellcome
source: Welcome
ar: مرحبا

source: Login
ar: تسجيل الدخول

source: Login To Continue Using The App
ar: تسجيل الدخول لمتابعة استخدام التطبيق

# login_email
source: Email
ar: البريد الإلكتروني

source: Enter Your Email
ar: أدخل بريدك الإلكتروني

# login_password
source: Password
ar: كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Pick the date
ar: اختر التاريخ

source: The operation has been cancelled
ar: تم إلغاء العملية

source: Edit start time
ar: تحرير وقت البدء

source: Edit end time
ar: تحرير وقت الانتهاء

source: You Have Updated Your Request from
ar: لقد قمت بتحديث طلبك من

source: The start time is after the end time
ar: وقت البدء بعد وقت الانتهاء

source: The start time can't be the same as the end time
ar: وقت البدء لا يمكن أن يكون نفس وقت الانتهاء

source: There was a conflict with another reservation
ar: كان هناك تعارض مع حجز آخر

source: Failed to fetch requests
ar: فشل في جلب الطلبات

# sign_up_cubit_in_admin_the_password_provided_is_too_weak
source: The password provided is too weak.
ar: كلمة المرور المقدمة ضعيفة جدًا.

source: The account already exists for that email.
ar: الحساب موجود بالفعل لهذا البريد الإلكتروني.

source: Something went wrong, please try later.
ar: حدث خطأ ما، يرجى المحاولة لاحقًا.

# login_cubit_messages_wrong_email_or_password
source: Wrong email or password
ar: البريد الإلكتروني أو كلمة المرور خاطئة

# select_time_cubit_in_book_hall_feature_pick_the_start_time
source: Pick the start time
ar: اختر وقت البدء

# select_time_cubit_in_book_hall_feature_the_operation_has_been_cancelled
source: The operation has been cancelled
ar: تم إلغاء العملية

# select_time_cubit_in_book_hall_feature_pick_the_end_time
source: Pick the end time
ar: اختر وقت الانتهاء

# select_time_cubit_in_book_hall_feature_pick_the_date
source: Pick the date
ar: اختر التاريخ

# select_time_cubit_in_book_hall_feature_the_start_time_cant_be_after_the_end_time
source: The start time can't be after the end time
ar: وقت البدء لا يمكن أن يكون بعد وقت الانتهاء

source: The end time can't be the same as the start time
ar: وقت الانتهاء لا يمكن أن يكون نفس وقت البدء

# show_user_requests_in_requests_feature_failed_to_fetch_requests
source: Failed to fetch requests
ar: فشل في جلب الطلبات

# user_edit_request_cubit_in_requests_feature_edit_the_date
source: Edit the date
ar: تحرير التاريخ

# user_edit_request_cubit_in_requests_feature_edit_start_time
source: Edit start time
ar: تحرير وقت البدء

# user_edit_request_cubit_in_requests_feature_edit_end_time
source: Edit end time
ar: تحرير وقت الانتهاء

# user_edit_request_cubit_in_requests_feature_you_have_updated_your_request_from
source: You Have Updated Your Request from
ar: لقد قمت بتحديث طلبك من

# user_edit_request_cubit_in_requests_feature_failed_to_update_request
source: Failed to update request
ar: فشل في تحديث الطلب

# user_edit_request_cubit_in_requests_feature_the_operation_has_been_cancelled
source: The operation has been cancelled
ar: تم إلغاء العملية

# user_edit_request_cubit_in_requests_feature_the_start_time_is_after_the_end_time
source: The start time is after the end time
ar: وقت البدء بعد وقت الانتهاء

source: The start time can't be the same as the end time
ar: وقت البدء لا يمكن أن يكون نفس وقت الانتهاء

source: There was a conflict with another reservation
ar: كان هناك تعارض مع حجز آخر

# something_went_wrong
source: Something went wrong, please try later
ar: حدث خطأ ما، يرجى المحاولة لاحقًا

source: You have modified
ar: لقد قمت بتعديل

source: Role to
ar: الصلاحيه إلى

source: Services has been modified to
ar: تم تعديل الخدمات إلى

source: Modify permissions
ar: تعديل الأذونات

source: Modify permissions for
ar: تعديل الأذونات لـ

source: Edit Services
ar: تعديل الخدمات

source: Edit Role
ar: تحرير الصلاحيه

# password_recovery
source: استعادة كلمة المرور
ar: Password Recovery

source: Send Reset To My Email
ar: إرسال إعادة تعيين إلى بريدي الإلكتروني

source: Don't have an account?
ar: لا تملك حسابًا؟

# app_bar_title_your_requests
source: your requests
ar: طلباتك

source: No Requests Yet
ar: لا يوجد طلبات بعد

source: Your request deleted successfully
ar: تم حذف طلبك بنجاح

source: Can't edit request, admin replied
ar: لا يمكنك تعديل هذا الطلب لأن المسؤول قد رد عليه بالفعل

source: Not Daily
ar: غير دائم

source: Daily
ar: دائم

source: Date
ar: تاريخ

source: App Theme
ar: الوضع

source: App Language
ar: اللغة

source: Hall added successfully
ar: تم اضافة القاعة بنجاح

source: Please select image
ar: ارجوك, قم باختيار صورة

source: All Users
ar: جميع المستخدمين

source: No Data Found
ar: لم يتم العثور علي بيانات

source: Request Accepted Successfully
ar: تم قبول الطلب بنجاح

source: Request Rejected Successfully
ar: تم رفض الطلب بنجاح

source: this request is already Unaccepted
ar: الطلب مرفوض بالفعل

source: Reservations
ar: الحجوزات

source: Add New Service?
ar: اضافة خدمة جديدة

source: save
ar: حفظ

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Remove Hall
ar: مسح القاعة

source: You have updated request from
ar: لقد قمت بتعديل الطلب من

source: The password provided is too weak.
ar: كلمة المرور المقدمة ضعيفة.

source: Alert
ar: تنبيه

source: needs to book
ar: يحتاج لحجز

source: from
ar: من

source: Accept
ar: قبول

source: Edit
ar: تعديل

source: Reject
ar: رفض

# is_This_reservatoin_Daily
source: is This reservation Daily?
ar: هل هذا الحجز دائم؟

source: Are You Sure To Remove This
ar: هل انت متأكد من حذف هذا

source: Add
ar: اضافة

source: Do you Need To Edit Your Request?
ar: هل تحتاج لتعديل طلبك؟

source: Do you Need To Delete Your Request?
ar: هل تحتاج لحذف طلبك؟

source: Delete
ar: حذف

source: All Halls
ar: جميع القاعات

# delete_request_alert
source: Are you sure you want to delete this request?
ar: هل انت متأكد من حذف هذا الطلب؟

source: Request which belongs to
ar: الطلب الذي يعود لـ

source: Request deleted successfully
ar: تم حذف الطلب بنجاح

source: All Requests
ar: جميع الطلبات

source: Request Accepted
ar: طلب مقبول

source: Request Rejected
ar: طلب مرفوض

# mokadma
source: Your application submitted to the
ar: الطلب المقدم علي

# hall_has_been_accepted
source: Hall has been accepted by
ar: تم قبوله من قبل

# hall_has_been_rejected
source: Hall has been rejected by
ar: تم رفضه من قبل

source: Logout
ar: تسجيل الخروج

source: Are you sure you want to log out?
ar: هل انت متأكد من تسجيل الخروج؟

source: Reservation Details
ar: تفاصيل الحجز

source: Reservation Time
ar: وقت الحجز

source: Event Name
ar: اسم الحدث

source: Hall Name
ar: اسم القاعة

source: Messages
ar: الرسائل

source: Value Requeired
ar: قيمة مطلوبة

source: Your Message
ar: رسالتك

source: Only admin can send messages
ar: يمكن للمشرف فقط ارسال رسائل

# developed_by
source: Devaloped By
ar: تم تطويره بواسطه
